app/views/admin/events/_form.html.erb

    <%= f.label :category_id %>
    <%= f.select :category_id, Category.all.map{ |c| [c.name, c.id] }, {}, :class => "form-control" %>
---
SELECT "categories".* FROM "categories"