app/controllers/admin/events_controller.rb

  def show
    @event = Event.find_by_friendly_id!(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."friendly_id" = ? LIMIT ?  [["friendly_id", "160aca81-207e-4ab9-8879-d26597b434c0"], ["LIMIT", 1]]

  def edit
    @event = Event.find_by_friendly_id!(params[:id])
    @event.tickets.build if @event.tickets.empty?
---
SELECT  "events".* FROM "events" WHERE "events"."friendly_id" = ? LIMIT ?  [["friendly_id", "160aca81-207e-4ab9-8879-d26597b434c0"], ["LIMIT", 1]]
SELECT  1 AS one FROM "tickets" WHERE "tickets"."event_id" = ? LIMIT ?  [["event_id", 1], ["LIMIT", 1]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."event_id" = ?  [["event_id", 1]]

  def update
    @event = Event.find_by_friendly_id!(params[:id])

    if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."friendly_id" = ? LIMIT ?  [["friendly_id", "160aca81-207e-4ab9-8879-d26597b434c0"], ["LIMIT", 1]]
UPDATE "events" SET "status" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["status", "public"], ["updated_at", 2017-08-16 14:49:07 UTC], ["id", 1]]

  def destroy
    @event = Event.find_by_friendly_id!(params[:id])
    @event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."friendly_id" = ? LIMIT ?  [["friendly_id", "d77be67b-5b65-4d62-8af6-eb18d436d0d4"], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 2]]

    def bulk_update
      total = 0
      Array(params[:ids]).each do |event_id|
        event = Event.find(event_id)

              if params[:commit] == I18n.t(:bulk_update)
                event.status = params[:event_status]
                if event.save
                  total = 1
                end
              elsif params[:commit] == I18n.t(:bulk_delete)
                event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 19]]