app/controllers/admin/users_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."id" IN (1, 2)
SELECT "users".* FROM "users"
---
     def index
       @users = User.includes(:groups).all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 4], ["created_at", 2017-08-17 15:37:28 UTC], ["updated_at", 2017-08-17 15:37:28 UTC]]
---
     def edit
       @user = User.find(params[:id])
       # 跟刚才后台情况一样，如果没有 @user.profile，要先新建一个
       # unless @user.profile 等同于 if !@user.profile 或 if @user.profile.nil?
       @user.create_profile unless @user.profile

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
     def update
       @user = User.find(params[:id])