app/controllers/users_controller.rb

  def update

    if @user.update(user_params)
---
UPDATE "users" SET "time_zone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["time_zone", "Beijing"], ["updated_at", 2017-08-16 14:34:56 UTC], ["id", 1]]