app/views/admin/users/edit.html.erb

SELECT "groups".* FROM "groups"
---
    <%= f.label :group_ids %>
    <%= f.select :group_ids, Group.all.map{ |g| [g.name, g.id] }, {}, :multiple => true, :class => "form-control" %><%= f.collection_check_boxes(:group_ids, Group.all, :id, :name) %>